package com.company;

public class Main {

    public static void main(String[] args) {
        System.out.println("Hello, world!");
        /*
        Что такое гит?
        Гит - это консольная утилита, для отслеживания и ведения истории изменения файлов, в вашем проекте.

        Какие еще бывают системы контроля версий?
        Subversion(SVN), TFS, Mercurial ...

        Для чего нужны системы контроля версий?
        Система контроля версий – это система, записывающая изменения
        в файл или набор файлов в течение времени и позволяющая вернуться позже к определенной версии.

        В чем разница между удаленным и локальным репозиториями?
        Удаленное это то которое находится на сервере, а локальное на нашем компьютере.Удаленное требует интернет, а локальное нет.
        Что делает команда commit?
        Сохраняем изменения на локальный репозиторий, тоесть на компьютер
        Что делает команда push?
        Сохраняем изменения на удаленный репозиторий, тоесть на сервер
        */
    }
}
